           TESTSUITE 'Beispiel Testsuite'

           TESTCASE 'Leere Hand'
           MOVE SPACES TO HAND
           EXPECT AUSGABE TO BE "Leere Hand"
           